cases/trembling2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoCentralDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   5e-4;

purgeWrite      200;

writeFormat     ascii;

writePrecision  9;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.5;

maxDeltaT       1e-5;

CourantType	faceCourant;

libs ("libcompressibleTools.so");

functions
{
    forces
    {
        type            forces;
        functionObjectLibs ("libforces.so");
        outputControl   timeStep;
        patches         (sphere);
        pName           p;
        UName           U;
        rhoName         rhoInf;
        log             yes;
        rhoInf          1;
        CofR            (0 0 0);
    }
	include "probeControl"
	include "curleControl"
	include "fwhControl"
	include "fwhFaceSet"
	include "surfaces"
}

// ************************************************************************* //
