cases/trembling2D/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        //- Master side patch
        name            side1;
        patchInfo
        {
            type            cyclic; //cyclicAMI;
            matchTolerance  0.0001;
            neighbourPatch  side2;
            transform       rotational;
            rotationAxis    (0 0 1);
            rotationCentre  (0 0 0);
        }
        constructFrom patches;
        patches (cyc1);
    }

    {
        //- Slave side patch
        name            side2;
        patchInfo
        {
            type            cyclic; //cyclicAMI;
            matchTolerance  0.0001;
            neighbourPatch  side1;
            transform       rotational;
            rotationAxis    (0 0 1);
            rotationCentre  (0 0 0);
        }
        constructFrom patches;
        patches (cyc2);
    }
);

// ************************************************************************* //
