cases/trembling2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    free
    {
        type            patch;
        nFaces          200;
        startFace       159400;
    }
    cyc1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          80000;
        startFace       159600;
    }
    cyc2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          80000;
        startFace       239600;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       319600;
    }
)

// ************************************************************************* //
