cases/trembling2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scheme1 vanLeer; //Minmod;

ddtSchemes
{
    default         CrankNicolson 0.75; //Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div((-devRhoReff&U))	  Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    
    //momentum equation
    div(phiNeg,U)	Gauss $scheme1;
    div(phiPos,U)	Gauss $scheme1;

    //energy equation
    div(phiNeg,h)	Gauss $scheme1;
    div(phiPos,h)	Gauss $scheme1;
    div(phiNeg,Ek)	Gauss $scheme1;
    div(phiPos,Ek)	Gauss $scheme1;

    //continuity equation
    div(phid_neg,p)	Gauss $scheme1;
    div(phid_pos,p)	Gauss $scheme1;
    
    div(phi,omega)   Gauss $scheme1;
    div(phi,epsilon) Gauss upwind; //vanLeer;
    div(phi,k)	     Gauss $scheme1;
    
    div(volMeshPhi,p)	Gauss $scheme1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    
    interpolate(rho)		linear;
    interpolate((rho*U))	linear;

    reconstruct(psi)		linear; //$scheme1;
    reconstruct(p)		$scheme1;
    reconstruct(U)		linear; //$scheme1;
    reconstruct(Dp)		$scheme1;

    //rhoCentralFoam
	interpolate(rhoU)	linear;  
	reconstruct(rho)	$scheme1;
	reconstruct(T)		$scheme1;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default	none;
    p;
}

wallDist
{
    method	meshWave;
}

// ************************************************************************* //
